[
    {
    "text": "Пишите код так, как будто сопровождать его будет склонный к насилию психопат, который знает, где вы живете",
    "author": "Стив Макконнелл"
    },
    {
    "text": "Сложность программы растет до тех пор, пока не превысит способности программиста",
    "author": "Артур Блох. Законы Мэрфи"
    },
    {
    "text": "Ходить по воде и разрабатывать программы, следуя ТЗ, очень просто… если они заморожены",
    "author": "И. Берард"
    },
    {
    "text": "Работает? Не трогай.",
    "author": "Любой программист"
    },
    {
    "text": "Иногда лучше остаться спать дома в понедельник, чем провести всю неделю в отладке написанного в понедельник кода.",
    "author": "Кристофер Томпсон"
    },
    {
    "text": "Измерять продуктивность программиста подсчетом строк кода — это так же, как оценивать постройку самолета по его весу.",
    "author": "Билл Гейтс"
    },
    {
    "text": "Многие из вас знакомы с достоинствами программиста. Их всего три, и разумеется это: лень, нетерпеливость и гордыня.",
    "author": "Лари Вэл"
    },
    {
    "text": "Молодые специалисты не умеют работать, а опытные специалисты умеют не работать.",
    "author": "Александр Голов"
    },
    {
    "text": "Чтобы написать чистый код, мы сначала пишем грязный код, а затем рефакторим его.",
    "author": "Роберт Мартин"
    },
    {
    "text": "Тестирование не позволяет обнаружить такие ошибки, как создание не того приложения.",
    "author": "Стив МакКонел"
    },
    {
    "text": "Нельзя доверять коду, который вы не написали полностью сами.",
    "author": "Кен Томпсон"
    },
    {
    "text": "Доказательство с помощью аналогий — это обман.",
    "author": "Бьёрн Страуструп"
    },
    {
    "text": "Думаю, это будет новой фичей. Только не говорите никому, что она возникла случайно.",
    "author": "Ларри Уолл"
    },
    {
    "text": "Тяжело улучшать код, который до этого уже улучшали много раз.",
    "author": "Ларри Уолл"
    },
    {
    "text": "Лень — главное достоинство программиста.",
    "author": "Ларри Уолл"
    },
    {
    "text": "Чтобы понять алгоритм, нужно его увидеть.",
    "author": "Дональд Эрвин Кнут"
    },
    {
    "text": "У меня предчувствие, что неизвестные цепочки ДНК расшифруются в копирайты и патенты.",
    "author": "Дональд Эрвин Кнут"
    },
    {
    "text": "У меня предчувствие, что неизвестные цепочки ДНК расшифруются в копирайты и патенты.",
    "author": "Дональд Эрвин Кнут"
    },
    {
    "text": "Если оптимизировать всё, что можно, то вы будете вечно несчастным.",
    "author": "Дональд Эрвин Кнут"
    },
    {
    "text": "Легче изобрести будущее, чем предсказать его.",
    "author": "Алан Кёртис Кэй"
    },
    {
    "text": "Лень — естественное состояние программиста, после которого он рождает хороший алгоритм.",
    "author": "Народное творчество"
    },
    {
    "text": "Способ использования интеллекта важнее, чем его уровень.",
    "author": "Стив Макконнелл"
    }
]  

